{
    "books": {
        
        "1": {
            "id": 1,
            "author": "ЕРІК ФРІМЕН, ЕЛІЗАБЕТ РОБСОН",
            "cover": "https://firebasestorage.googleapis.com/v0/b/script-store-50560.appspot.com/o/1.%20Head%20First%20JavaScript%20Programming.png?alt=media&token=7886a789-24ab-4022-b147-c8ea319b2313",
            "title": "«Head First. Програмування на JavaScript»",
            "price": "$10.99",
            "description": "Об’ємний посібник, де зібрана ключова інформація про JavaScript: від основ до складніших тем — типів, масивів, функцій, об’єктів та DOM. Зачіпають також успадкування прототипів та тестування продуктів. ",
            "benefits": {
                "1": "книга гарно підійде для людей, що люблять вікторини, головоломки та вправи для закріплення матеріалу;",
                "2": "послідовна структура, що дозволяє засвоїти простіші теми, перш ніж перейти до складних. "
            }
        },
        
        "2": {
            "id": 2,
            "author": "МАРК МАЙЄРС",
            "cover": "https://firebasestorage.googleapis.com/v0/b/script-store-50560.appspot.com/o/2.%20A%20Smarter%20Way%20to%20Learn%20JavaScript%20by%20Mark%20Myers.png?alt=media&token=5889acb0-d36a-4f0a-9282-f6889bfb181d",
            "title": "«Розумніший спосіб вивчати JavaScript»",
            "price": "$31.99",
            "description": "Посібник для початківців із акцентом на розуміння та запам'ятовування правильного синтаксису. Книжка будується на постійному закріпленні теоретичних знань через велику кількість додаткових завдань. Як обіцяє Марк Майєрс, на практику йде у два-три рази більше часу, ніж на читання.",
            "benefits": {
                "1": "інформацію подають невеликими «порціями» — середньостатистичний учень зможе засвоїти один розділ за 10 хвилин;",
                "2": "є сайт із вправами для кожного розділу, де можна попрактикуватися й закріпити все, про що ви дізналися;",
                "3": "матеріал пояснюють простою нетехнічною англійською мовою."
            }
        },

        "3": {
            "id": 3,
            "author": "НІК МОРГАН",
            "cover": "https://firebasestorage.googleapis.com/v0/b/script-store-50560.appspot.com/o/3.%20JavaScript%20for%20Kids.png?alt=media&token=0b9774f9-e056-4f96-bc3b-6e3ef53a5b32",
            "title": "«JavaScript для дітей. Веселий вступ до програмування»",
            "price": "$8.99",
            "description": "Попри те, що книга орієнтована на дітей, вона може слугувати хорошим посібником для початківців будь-якого віку. Розповідь починається з основ, таких як робота з рядками, масивами та циклами, а далі автори переходять до складніших тем — наприклад, створення інтерактивності з jQuery та малювання графіки за допомогою Canvas. «Це зовсім базове видання, де початківці можуть ознайомитися з синтаксисом та базовими поняттями мови», — каже Марія Образцова. ",
            "benefits": {
                "1": "мова викладання проста та зрозуміла;",
                "2": "книжка дає достатньо знань, щоби самостійно розробити просту гру, зокрема Find the Buried Treasure, Hangman чи Snake;",
                "3": "швидкий спосіб розібратися, чи подобається вам програмування загалом — і як процес, і як результат."
            }
        },

        "4": {
            "id": 4,
            "author": "ДУГЛАС КРОКФОРД",
            "cover": "https://firebasestorage.googleapis.com/v0/b/script-store-50560.appspot.com/o/4.%20JavaScript%20The%20Good%20Parts%20by%20Douglas%20Crockford.png?alt=media&token=d28abb92-6349-4b06-8911-8f7dda2782fb",
            "title": "«Як влаштований JavaScript»",
            "price": "$18.99",
            "description": "Існує думка, що JavaScript має більше недоліків, ніж переваг. Однак Дуглас Крокфорд, який відіграв значну роль у розвитку JS, звертає увагу на іншу, «хорошу» частину мови — надійну, читабельну, підтримувану, придатну для створення масштабованого та ефективного коду. Так, у книжці пояснюється робота із синтаксисом обміну, функціями, методами, масивами, регулярними виразами тощо. На початку складно зрозуміти, що саме вчити, на чому зосереджуватися. Ця книжка допомагає не витрачати ресурс на пошук базової теорії в різних місцях, а дає впорядковану й доступну інформацію», — каже Марія Образцова.",
            "benefits": {
                "1": "розбір вдалих прикладів та помилок — з поясненням, як їх уникати;",
                "2": "«сухої» теорії небагато, й вона добре структурована;", 
                "3": "чимало прикладів з досвіду автора."
            }
        },

        "5": {
            "id": 5,
            "author": "ДЖОН ДАКЕТТ",
            "cover": "https://firebasestorage.googleapis.com/v0/b/script-store-50560.appspot.com/o/5.%20JavaScript%20%26%20JQuery%20Interactive%20Front-End%20Web%20Development%20by%20Jon%20Duckett.png?alt=media&token=1a3596a5-6387-4341-bc15-e5ed7551ee74",
            "title": "«Javascript та jQuery. Інтерактивна веброзробка»",
            "price": "$14.99",
            "description": "Книжка насичена візуальними матеріалами. Вони дозволяють краще відчути, як зробити вебсторінки більш інтерактивними, а інтерфейси — більш інтуїтивно зрозумілими. Автор на прикладах показує, як з нуля проєктувати сценарії JavaScript, JavaScript API, а також jQuery. Щоби ефективно опрацювати книжку, знадобляться базові знання HTML та CSS.",
            "benefits": {
                "1": "проста та зрозуміла мова;",
                "2": "багато візуальних елементів роблять взаємодію з книгою цікавішою."
            }
        },

        "6": {
            "id": 6,
            "author": "",
            "cover": "https://firebasestorage.googleapis.com/v0/b/script-store-50560.appspot.com/o/6.%20JavaScript.Info.png?alt=media&token=f8d531ca-7f66-435b-8acf-6127d5fa890c",
            "title": "JavaScript.Info",
            "price": "",
            "description": "Онлайн-підручник із сучасного JavaScript, що містить прості, але докладні пояснення з прикладами та завданнями. Є інформація про замикання, DOM, події та об'єктно-орієнтоване програмування. «Це не зовсім книжка, але сайт можна прирівняти до повноцінного посібника по JS», — каже Марія.«По структурі він як звичайне видання: розділений на три великі блоки та маленькі глави у них. Довідник влаштований так, що при послідовному читанні знання нашаровуються одне на одне — і уявлення про мову стає більш комплексним. Я багато користувалася ним, коли вчила JavaScript, але до нього можуть звертатися і мідли, і сеньйори, якщо потрібно освіжити знання», — додає розробниця.",
            "benefits": ""
        },

        "7": {
            "id": 7,
            "author": "DAVID FLANAGAN",
            "cover": "https://firebasestorage.googleapis.com/v0/b/script-store-50560.appspot.com/o/7.%20JavaScript%20The%20Definitive%20Guide.png?alt=media&token=b30306e7-cca4-4e87-840d-29a92bce210e",
            "title": "«JavaScript: The Definitive Guide»",
            "price": "$36.99",
            "description": "Книга стане справді настільним довідником, адже охоплює всі нюанси роботи з мовою — від основних операцій зі значеннями різних типів до рушіїв. Серед інших понять, які охоплює автор — замикання, графіка та прототипування, а також суміжні з JS теми, як-от регулярні вирази й Node.js.",
            "benefits": {
                "1": "актуальна та сучасна інформація — автор сім разів перевидавав книгу, аби вдосконалити кожен розділ;",
                "2": "пояснення підійдуть як для тих, хто працює з клієнтською версією JS, так і для тих, хто використовує серверну;",
                "3": "багато релевантних прикладів."
            }
        },

        "8": {
            "id": 8,
            "author": "ADITYA Y. BHARGAVA",
            "cover": "https://firebasestorage.googleapis.com/v0/b/script-store-50560.appspot.com/o/8.%20Grokking%20Algorithms%20An%20Illustrated%20Guide%20for%20Programmers%20and%20Other%20Curious%20People.png?alt=media&token=1efcc838-bd0e-4f6b-ad8d-46dbe5885fae",
            "title": "Grokking Algorithms: An Illustrated Guide for Programmers and Other Curious People",
            "price": "$29.99",
            "description": "Книжка не висвітлює безпосередньо JavaScript, але вважається одним з найкращих видань про алгоритми та структуру даних. Вона складається з 11 розділів, де йдеться про сортування, рекурсію, хештаблиці, зв’язані списки, а також динамічне програмування. «Її корисно прочитати як джунам, так і мідлам та сеньйорам, які прагнуть зробити свої програми більш логічними», — каже Марія.",
            "benefits": {
                "1": "проста та зрозуміла мова, поняття введені у контекст;",
                "2": "малюнки допомагають краще уявити структуру роботи алгоритмів та структур даних;",
                "3": "багато прикладів."
            }
        },

        "9": {
            "id": 9,
            "author": "NICHOLAS C. ZAKAS",
            "cover": "https://firebasestorage.googleapis.com/v0/b/script-store-50560.appspot.com/o/9.%20%D0%9Digh%20Performance%20JavaScript.png?alt=media&token=d22576a9-3fda-4558-91d9-99a87d4a1430",
            "title": "«Нigh Performance JavaScript»",
            "price": "$12.99",
            "description": "Динаміка сайтів будується в основному на JavaScript — і це одна з найцікавіших частин роботи з мовою. Втім, є мінус — через це сторінки можуть завантажуватися повільніше або взагалі не працювати, що погіршує User Experience. Книжка допомагає зрозуміти фактори, що негативно впливають на продуктивність, та пропонує прийоми й лайфхаки, які допомагають усунути проблеми.",
            "benefits": {
                "1": "багато важливої інформації про обробку даних та об’єктів;",
                "2": "описаний досвід об’ємний та цікавий, адже Ніколас Закас долучив до написання рок-зірок програмування — Росса Хармса, Жульєна Леконта, Стівена Левітана, Стояна Стефанова та Метта Суїні."
            }
        },

        "10": {
            "id": 10,
            "author": "KYLE SIMPSON",
            "cover": "https://firebasestorage.googleapis.com/v0/b/script-store-50560.appspot.com/o/10.%20You%20Don%E2%80%99t%20Know%20JS.png?alt=media&token=1158f1a4-0081-46bf-b732-69247c898f42",
            "title": "«You Don’t Know JS»",
            "price": "$10.89",
            "description": "Серія складається з шести книг, які слід читати послідовно. Так, перша книжка, «Up & Going» охоплює основи мови, включаючи типи, значення та змінні. Друга — «Scope & Closures» — заглиблюється в роботу системи області видимості JavaScript, і в те, як працюють закриття. Останні підручники серії працюють зі складнішими поняттями. Наприклад, п’ята книга, «Async & Performance», присвячена асинхронному програмуванню та оптимізації продуктивності, а остання «ES6&Beyond» розповідає про нові можливості, представлені в ECMAScript 6 та пізніших версіях мови.«Я зверталася до одного з видань, коли розбиралася в об’єктах і класах. Теорія описана досить просто та зрозуміло. Крім того, там є нюанси, які цікаво дізнатися для загального розвитку, і які ти не вивчаєш, коли треба швидко опанувати мову, щоб виконувати робочі завдання», — каже Марія.",
            "benefits": {
                "1": "кожна книга написана під певний рівень знань;",
                "2": "завдання та приклади релевантні до реальної роботи розробника;",
                "3": "численні приклади коду з докладними поясненнями."
            }
        },

        "11": {
            "id": 11,
            "author": "DAVID HERMAN",
            "cover": "https://firebasestorage.googleapis.com/v0/b/script-store-50560.appspot.com/o/11.%20Effective%20JavaScript.png?alt=media&token=11f6ea2d-e23c-4b83-851d-d8167ea59d48",
            "title": "«Effective JavaScript» ",
            "price": "$14.49",
            "description": "Девід Херман, який багато років працює над стандартизацією мови, надає 68 перевірених підходів до написання кращого коду на JavaScript. Він пояснює нюанси роботи з масивами та об’єктами, особливості ООП, функції та семантику змінних — та підкріпляє теорію конкретними прикладами.",
            "benefits": {
                "1": "містить інформацію, щоб заповнити прогалини у фундаментальній теорії JavaScript;",
                "2": "насичена прикладами з особистої практики автора, а також рекомендаціями для створення застосунків різного масштабу."
            }
        },

        "12": {
            "id": 12,
            "author": "CAY HORSTMANN",
            "cover": "https://firebasestorage.googleapis.com/v0/b/script-store-50560.appspot.com/o/12.%20Modern%20JavaScript%20for%20the%20Impatient.png?alt=media&token=8622f93b-3458-4538-85d1-c3610ee600b4",
            "title": "«Modern JavaScript for the Impatient» ",
            "price": "$26.49",
            "description": "Вичерпний посібник із JavaScript ES6 та сучасніших версій мови, де зібрано практичні рекомендації та зразки коду. Книжка допомагає ефективно використати всі новинки JavaScript, уникаючи помилок і застарілого синтаксису. Книга підійде для тих, хто вже працював з іншими мовами та хоче швидко зрозуміти JavaScript.",
            "benefits": {
                "1": "можливість опанувати сучасний стандарт JS без занурення у старіші версії;",
                "2": "«ігрова» система навігації з натяком на «Алісу в Дивокраї». Картинки позначають складність розділів: Білий Кролик — основи, Аліса — матеріали середнього рівня складності, Чеширський кіт — просунуті теми, Капелюшник — теми «із зірочкою» для найбільш зацікавлених."
            }
        },

        "13": {
            
        }





    }

}