{
    "books": {
        
        "1": {
            "id": 1,
            "author": "ЕРІК ФРІМЕН, ЕЛІЗАБЕТ РОБСОН",
            "cover": "https://firebasestorage.googleapis.com/v0/b/script-store-50560.appspot.com/o/1.%20Head%20First%20JavaScript%20Programming.png?alt=media&token=7886a789-24ab-4022-b147-c8ea319b2313",
            "title": "«Head First. Програмування на JavaScript»",
            "price": "$10.99",
            "description": "Об’ємний посібник, де зібрана ключова інформація про JavaScript: від основ до складніших тем — типів, масивів, функцій, об’єктів та DOM. Зачіпають також успадкування прототипів та тестування продуктів. ",
            "benefits": {
                "1": "книга гарно підійде для людей, що люблять вікторини, головоломки та вправи для закріплення матеріалу;",
                "2": "послідовна структура, що дозволяє засвоїти простіші теми, перш ніж перейти до складних. "
            }
        },
        
        "2": {
            "id": 2,
            "author": "МАРК МАЙЄРС",
            "cover": "https://firebasestorage.googleapis.com/v0/b/script-store-50560.appspot.com/o/2.%20A%20Smarter%20Way%20to%20Learn%20JavaScript%20by%20Mark%20Myers.png?alt=media&token=5889acb0-d36a-4f0a-9282-f6889bfb181d",
            "title": "«Розумніший спосіб вивчати JavaScript»",
            "price": "$31.99",
            "description": "Посібник для початківців із акцентом на розуміння та запам'ятовування правильного синтаксису. Книжка будується на постійному закріпленні теоретичних знань через велику кількість додаткових завдань. Як обіцяє Марк Майєрс, на практику йде у два-три рази більше часу, ніж на читання.",
            "benefits": {
                "1": "інформацію подають невеликими «порціями» — середньостатистичний учень зможе засвоїти один розділ за 10 хвилин;",
                "2": "є сайт із вправами для кожного розділу, де можна попрактикуватися й закріпити все, про що ви дізналися;",
                "3": "матеріал пояснюють простою нетехнічною англійською мовою."
            }
        },

        "3": {
            "id": 3,
            "author": "НІК МОРГАН",
            "cover": "https://firebasestorage.googleapis.com/v0/b/script-store-50560.appspot.com/o/3.%20JavaScript%20for%20Kids.png?alt=media&token=0b9774f9-e056-4f96-bc3b-6e3ef53a5b32",
            "title": "«JavaScript для дітей. Веселий вступ до програмування»",
            "price": "$8.99",
            "description": "Попри те, що книга орієнтована на дітей, вона може слугувати хорошим посібником для початківців будь-якого віку. Розповідь починається з основ, таких як робота з рядками, масивами та циклами, а далі автори переходять до складніших тем — наприклад, створення інтерактивності з jQuery та малювання графіки за допомогою Canvas. «Це зовсім базове видання, де початківці можуть ознайомитися з синтаксисом та базовими поняттями мови», — каже Марія Образцова. ",
            "benefits": {
                "1": "мова викладання проста та зрозуміла;",
                "2": "книжка дає достатньо знань, щоби самостійно розробити просту гру, зокрема Find the Buried Treasure, Hangman чи Snake;",
                "3": "швидкий спосіб розібратися, чи подобається вам програмування загалом — і як процес, і як результат."
            }
        },

        "4": {
            "id": 4,
            "author": "ДУГЛАС КРОКФОРД",
            "cover": "https://firebasestorage.googleapis.com/v0/b/script-store-50560.appspot.com/o/4.%20JavaScript%20The%20Good%20Parts%20by%20Douglas%20Crockford.png?alt=media&token=d28abb92-6349-4b06-8911-8f7dda2782fb",
            "title": "«Як влаштований JavaScript»",
            "price": "$18.99",
            "description": "Існує думка, що JavaScript має більше недоліків, ніж переваг. Однак Дуглас Крокфорд, який відіграв значну роль у розвитку JS, звертає увагу на іншу, «хорошу» частину мови — надійну, читабельну, підтримувану, придатну для створення масштабованого та ефективного коду. Так, у книжці пояснюється робота із синтаксисом обміну, функціями, методами, масивами, регулярними виразами тощо. На початку складно зрозуміти, що саме вчити, на чому зосереджуватися. Ця книжка допомагає не витрачати ресурс на пошук базової теорії в різних місцях, а дає впорядковану й доступну інформацію», — каже Марія Образцова.",
            "benefits": {
                "1": "розбір вдалих прикладів та помилок — з поясненням, як їх уникати;",
                "2": "«сухої» теорії небагато, й вона добре структурована;", 
                "3": "чимало прикладів з досвіду автора."
            }
        },

        "5": {
            "id": 5,
            "author": "ДЖОН ДАКЕТТ",
            "cover": "https://firebasestorage.googleapis.com/v0/b/script-store-50560.appspot.com/o/5.%20JavaScript%20%26%20JQuery%20Interactive%20Front-End%20Web%20Development%20by%20Jon%20Duckett.png?alt=media&token=1a3596a5-6387-4341-bc15-e5ed7551ee74",
            "title": "«Javascript та jQuery. Інтерактивна веброзробка»",
            "price": "$14.99",
            "description": "Книжка насичена візуальними матеріалами. Вони дозволяють краще відчути, як зробити вебсторінки більш інтерактивними, а інтерфейси — більш інтуїтивно зрозумілими. Автор на прикладах показує, як з нуля проєктувати сценарії JavaScript, JavaScript API, а також jQuery. Щоби ефективно опрацювати книжку, знадобляться базові знання HTML та CSS.",
            "benefits": {
                "1": "проста та зрозуміла мова;",
                "2": "багато візуальних елементів роблять взаємодію з книгою цікавішою."
            }
        }


    }

}